htmlized-src/c/qsort.org.html
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<!-- Created by htmlize-1.34 in css mode. -->
<html>
  <head>
    <title>qsort.org</title>
  </head>
  <body>
    <pre>
<span class="comment"># -*- coding:utf-8 -*-</span>
<span class="org-meta-line">#+LANGUAGE:  zh
</span><span class="org-document-info-keyword">#+TITLE:</span><span class="comment">     </span><span class="org-document-title">qsort &#19982;&#20989;&#25968;&#25351;&#38024; </span>
<span class="org-document-info-keyword">#+AUTHOR:</span><span class="comment">    </span><span class="org-document-info">&#32426;&#31168;&#23792;</span>
<span class="org-document-info-keyword">#+EMAIL:</span><span class="comment">     </span><span class="org-document-info">jixiuf@gmail.com</span>
<span class="org-document-info-keyword">#+DATE:</span><span class="comment">     </span><span class="org-document-info">2011-10-26 &#19977;</span>
<span class="org-meta-line">#+DESCRIPTION:qsort &#19982;&#20989;&#25968;&#25351;&#38024; 
#+KEYWORDS: 
#+OPTIONS:   H:2 num:nil toc:t \n:t @:t ::t |:t ^:t -:t f:t *:t &lt;:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil 
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+FILETAGS: @C
</span><span class="org-block-begin-line">#+begin_src c
</span><span class="org-block">
#include &lt;stdio.h&gt;
#include &lt;stdlib.h&gt;
#include &lt;malloc.h&gt;
#include &lt;string.h&gt;
//&#32479;&#35745;&#25991;&#20214;&#20013;&#23383;&#31526;&#25968;,&#21333;&#35789;&#25968;,&#34892;&#25968;
int comp(int *a ,int *b ){
  return *a&lt;*b;
}

int main(int argc, char *argv[])
{
  int i,s[] ={ 1,3 ,12,5 };
  /* &#22768;&#26126;&#19968;&#20010;&#20989;&#25968;&#25351;&#38024;,&#23427;&#25351;&#21521;&#19968;&#20010;&#20989;&#25968; */
  int (*c)()=comp;

  /* qsort() &#20989;&#25968;,&#31532;&#19968;&#20010;&#26159;&#24453;&#25490;&#24207;&#30340;&#25968;&#32452;,
     &#21442;&#25968;2,&#26159;&#25968;&#32452;&#30340;&#38271;&#24230;,
     &#21442;&#25968;3&#26159;&#27599;&#20010;&#20803;&#32032;&#30340;&#38271;&#24230;
     *&#21442;&#25968;4&#26159;&#19968;&#20010;&#20989;&#25968;&#25351;&#38024;,&#36825;&#20010;&#20989;&#25968;&#25509;&#21463;&#20004;&#20010;&#21442;&#25968;,
     &#27492;&#20989;&#25968;&#29992;&#20110;&#27604;&#36739;
  */
  qsort(s,4,sizeof(int),c);

  for(i=0;i&lt;4;i++){
    printf ("%d,",s[i]);
  }
  return 0;
}
</span><span class="org-block-end-line">#+end_src
</span></pre>
  </body>
</html>
